{"meta":{"title":"codeforce","subtitle":"codeforce","description":"","author":"CXQ","url":"https://www.codeforce.top","root":"/"},"pages":[{"title":"404","date":"2018-09-30T09:25:30.000Z","updated":"2020-06-28T13:54:20.303Z","comments":true,"path":"404.html","permalink":"https://www.codeforce.top/404.html","excerpt":"","text":""},{"title":"categories","date":"2018-09-30T09:25:30.000Z","updated":"2020-06-28T13:51:03.087Z","comments":true,"path":"categories/index.html","permalink":"https://www.codeforce.top/categories/index.html","excerpt":"","text":""},{"title":"tags","date":"2018-09-30T10:23:38.000Z","updated":"2020-06-28T13:50:47.825Z","comments":true,"path":"tags/index.html","permalink":"https://www.codeforce.top/tags/index.html","excerpt":"","text":""},{"title":"about","date":"2018-09-30T09:25:30.000Z","updated":"2020-06-28T13:52:01.479Z","comments":true,"path":"about/index.html","permalink":"https://www.codeforce.top/about/index.html","excerpt":"","text":""},{"title":"friends","date":"2018-12-12T13:25:30.000Z","updated":"2020-06-28T13:52:22.115Z","comments":true,"path":"friends/index.html","permalink":"https://www.codeforce.top/friends/index.html","excerpt":"","text":""}],"posts":[{"title":"单词","slug":"单词","date":"2021-01-11T03:44:15.000Z","updated":"2021-01-11T03:48:07.137Z","comments":true,"path":"2021/01/11/dan-ci/","link":"","permalink":"https://www.codeforce.top/2021/01/11/dan-ci/","excerpt":"","text":"","categories":[{"name":"英语","slug":"英语","permalink":"https://www.codeforce.top/categories/%E8%8B%B1%E8%AF%AD/"}],"tags":[{"name":"英语","slug":"英语","permalink":"https://www.codeforce.top/tags/%E8%8B%B1%E8%AF%AD/"}]},{"title":"计算机英语-翻译","slug":"计算机英语-翻译","date":"2021-01-11T02:21:13.000Z","updated":"2021-01-11T02:23:11.086Z","comments":true,"path":"2021/01/11/ji-suan-ji-ying-yu-fan-yi/","link":"","permalink":"https://www.codeforce.top/2021/01/11/ji-suan-ji-ying-yu-fan-yi/","excerpt":"","text":"Unit 1翻译Computers will become more advanced and they will also become easier to use. 计算机将变得更先进，也将变得更容易使用。 Improved speech recognition will make the operation of a computer easier. 语音识别的改进将使计算机的操作更加容易。 Virtual reality(虚拟现实),the technology of interacting with a computer using all of the human senses, will also contribute to better human and computer interfaces(界面，接口). 虚拟现实，即使用所有人类官能与计算机进行交互的技术，也将有助于创建更好的人机接口。 Other ,exotic(奇异的)models of computation are being developed, including biological computing that uses living organisms, molecular (分子的) computing that uses molecules with particular properties, and computing that uses deoxyribonucleic acid (DNA), the basic unit of heredity(遗传), to store data and carry out operations. 人们正在开发其他的奇异计算模型，包括使用生物机体的生物计算、使用具有特定属性的分子的分子计算，以及使用遗传基本单位DNA（脱氧核糖核酸）存储数据和执行运算的计算。 These are examples of possible future computational platforms that, so far, are limited in abilities or are strictly theoretical. 这些都是可能的未来计算平台的例子，而它们迄今还能力有限或完全属于理论范畴。 Scientists investigate them because of the physical limitations of miniaturizing circuits embedded in silicon. There are also limitations related to heat generated by even the tiniest of transistors. 科学家们研究它们，是因为嵌入硅中的电路的微小型化受到物理限制。还有一些限制与即使最微小的晶体管也会产生的热量有关。 计算机将变得更加先进，也将变得更加容易使用。语音识别的改进将使计算机的操作更加容易。虚拟现实，即使用所有人类官能与计算机进行交互的技术，也将有助于创建更好的人机接口。人们正在开发其他的奇异计算模型，包括使用生物机体的生物计算、使用具有特定属性的分子计算，以及使用遗传基本单位DNA（脱氧核糖核酸）存储数据和执行运算的计算。这些都是可能的未来计算平台的例子，而它们迄今还能力有限或完全属于理论范畴。科学家们研究它们，是因为嵌入硅中的电路的微小型化受到物理限制。还有一些限制与即使最微小的晶体管也会产生的热量有关。 Unit 2翻译A modem is a device that converts between analog and digital signals. 调制解调器是在模拟与数字信号之间进行转换的设备。 Digital signals, which are used by computers. are made up of separate units, usually represented by a series of 1’s and 0’s. Analog signals vary continuously; an example of an analog signal is a sound wave. 计算机使用的是数字信号，这种信号由离散单元组成，通常用一系列1和О表示。模拟信号是连续变化的;声波就是模拟信号的一个例子。 Modems are often used to enable computers to communicate with each other across telephone lines. 调制解调器经常用于实现计算机之间通过电话线的互相通信。 A modem converts the digital signals of the sending computer to analog signals that can be transmitted through telephone lines. 调制解调器将发送端计算机的数字信号转换成可通过电话线传输的模拟信号。 When the signal reaches its destination, another modem reconstructs the original digital signal, which is processed by the receiving computer. 信号到达目的地后，另外一个调制解调器重构原来的数字信号，供接收端计算机处理。 If both modems can transmit data to each other simultaneously, the modems are operating in full duplex (双工的) mode; if only one modem can transmit at a time, the modems are operating in half duplex mode. 如果两个调制解调器可同时互相发送数据，那么它们采用的就是全双工工作方式;如果一次只有一个调制解调器可以发送数据，那么它们采用的则是半双工工作方式。 调制解调器是在模拟与数字信号之间进行转换的设备。 计算机使用的是数字信号，这种信号由离散单元组成，通常用一系列1和0表示。 模拟信号是连续变化的；声波就是模拟信号的一个例子。 调制解调器经常用于实现计算机之间通过电话线的互相通信。 调制解调器将发送端计算机的数字信号转换成可通过电话线传输的模拟信号。 信号到达目的地后，另外一个调制解调器重构原来的数字信号，供接收端计算机处理。 如果两个调制解调器可同时互相发送数据，那么它们采用的就是全双工工作方式；如果一次只有一个调制解调器可以发送数据，那么它们采用的则是半双工工作方式。 Unit 3翻译Object-oriented programming (OOP) languages, such as C++ and Java, are based on traditional high-level languages, but they enable a programmer to think in terms of collections of cooperating objects instead of lists of commands. 面向对象程序设计语言，如C++和 Java，基于传统的高级语言，但它们使程序设计员能够从合作对象集而非命令列表的角度进行思考。 Objects, such as a circle, have properties such as the radius (半径) of the circle and the command that draws it on the computer screen. 诸如圆之类的对象具有像圆的半径一类的属性，以及在计算机屏幕上绘制该对象的命令。 Classes of objects can inherit features from other classes of objects. 一个对象类可以从其他的对象类继承特征。 For example, a class defining squares can inherit features such as right angles from a class defining rectangles (长方形). 例如，定义正方形的类可以从定义长方形的类那里继承直角等特征。 This set of programming classes simplifies the programmer’s task, resulting in more “reusable” computer code. 这一套程序设计类简化了程序设计员的工作，带来了更多“可复用的”计算机代码。 Reusable code allows a programmer to use code that has already been designed, written, and tested. 可复用代码使程序设计员可以使用已经设计、编写和测试的代码。 This makes the programmer’s task easier, and it results in more reliable and efficient programs. 这使得程序设计员的工作变得比较容易，并带来更加可靠和高效的程序。 面向对象程序设计语言，如C++和Java，基于传统的高级语言，但它们使程序设计员能够从合作对象集而非命令列表的角度进行思考。诸如圆之类的对象具有像圆的半径一类的属性，以及在计算机屏幕上绘制该对象的命令。一个对象类可以从其他的对象类继承特征。例如，定义正方形的类可以从定义长方形的类那里继承直角等特征。这一套程序设计类简化了程序设计员的工作，带来了更多“可复用的”计算机代码。可复用代码使程序设计员可以使用已经设计、编写和测试的代码。这使得程序设计员的工作变得比较容易，并带来更加可靠和高效的程序。 Unit 6翻译In a relational database, the rows of a table represent records (collections of information about separate items) and the columns represent fields (particular attributes of a record). 在关系数据库中，表的行表示记录（关于不同项的信息集），列表示字段（一个记录的特定属性）。 In conducting searches, a relational database matches information from a field in one table with information in a corresponding field of another table to produce a third table that combines requested data from both tables. 在进行搜索时，关系数据库将一个表中的一个字段的信息与另一个表的一个相应字段的信息进行匹配，以生成将来自这两个表的所要求数据结合起来的另一个表。 For example, if one table contains the fields EMPLOYEE-ID, LAST-NAME, FIRST-NAME, and HIRE-DATE, and another table contains the fields DEPT, EMPLOYEE-ID, and SALARY, a relational database can match the EMPLOYEE-ID fields in the two tables to find such information as the names of all employees earning a certain salary or the departments of all employees hired after a certain date. 例如，如果一个表包含EMPILOYEE-YEF-ID 和 SALARY字段，关系数据招阵BHEL混这斯众阶有另一个表包含DEPT、EMPLY公 E宁的信息，如所有挣到一定薪水的雇员的姓名或所有的EMPLOYEE-ID字段，以找到特定的信息，如所有挣到一定薪水的雇员的姓名或所有在某个日期之后受雇的雇员所属的部门。 In other words, a relational database uses matching values in two tables to relate information in one to information in the other. Microcomputer database products typically are relational databases. 换言之，关系数据库使用两个表中的匹配值，将一个表中的信息与另一个表中的信息联系起来。微型计算机数据库产品一般是关系数据库。 在关系数据库中，表的行表示记录（关于不同项的信息集），列表示字段（一个记录的特定属性）。 在进行搜索时，关系数据库将一个表中的一个字段的信息与另一个表的一个相应字段的信息进行匹配，以生成将来自这两个表的所要求数据结合起来的另一个表。例如，如果一个表包含EMPLOYEE-ID、LAST-NAME、FIRST-NAME和HIRE-DATE字段，另一个表包含DEPT、EMPLOYEE-ID和SALARY字段，关系数据库可匹配这两个表中的EMPLOYEE-ID字段，以找到特定的信息，如所有挣到一定薪水的雇员的姓名或所有在某个日期之后受雇的雇员所属的部门。 换言之，关系数据库使用两个表中的匹配值，将一个表中的信息与另一个表中的信息联系起来。微型计算机数据库产品一般是关系数据库。 Unit 9翻译Cloud computing applies a virtualized platform with elastic resources on demand by provisioning hardware, software and data sets dynamically. 云计算动态供应硬件、软件和数据集，以此方式按需应用一个拥有弹性资源的虚拟化平台。 The idea is to move desktop computing to a service-oriented platform using server clusters and huge databases at data centers. 其目的是通过在数据中心使用服务器集群和巨型数据库而将桌面计算转移到一个面向服务的平台。 Cloud computing leverages its low cost and simplicity to benefit both users and providers. 云计算充分利用其低成本与简单的特性既惠及用户也惠及提供商。 Machine virtualization has enabled such cost-effectiveness. 机器虚拟化使这样的成本效益成为可能。 Cloud computing intends to satisfy many user applications simultaneously. 云计算意在同时满足许多用户应用程序的需要。 The cloud ecosystem（生态系统) must be designed to be secure, trustworthy, and dependable. 云生态系统必须设计得具有安全性、可信性和可靠性。 Some computer users think of the cloud as a centralized resource pool. Others consider the cloud to be a server cluster which practices distributed computing over all the servers used. 有些计算机用户将云视为一个集中式资源池，而另外一些计算机用户则认为云是一个在所用的各个服务器上实行分布式计算的服务器集群。 Traditionally, a distributed computing system tends to be owned and operated by an autonomous administrative domain (e.g. a research laboratory or company) for on-premises(机构内部的)computing needs. 传统上，一个分布式计算系统往往由一个自主管理域（如一个研究实验室或公司)为内部计算需要而拥有和使用。 However, these traditional systems have encountered several performance bottlenecks(瓶颈):constant system maintenance, poor utilization, and increasing costs associated with hardware/software upgrades(升级). 然而，这些传统系统遭遇数个性能瓶颈:系统维护需要不断进行;利用率差;与硬件/软件升级有关的费用日益增长。 Cloud computing as an on-demand computing paradigm resolves or relieves us from these problems. 作为一种按需计算范式，云计算可解决这些问题或可使我们摆脱这些问题。 云计算动态供应硬件、软件和数据集，以此方式按需应用一个拥有弹性资源的虚拟化平台。其目的是通过在数据中心使用服务器集群和巨型数据库而将桌面计算转移到一个面向服务的平台。云计算充分利用其低成本与简单的特性既惠及用户也惠及提供商。机器虚拟化使这样的成本效益成为可能。云计算意在同时满足许多用户应用程序的需要。云生态系统必须设计得具有安全性、可信性和可靠性。有些计算机用户将云视为一个集中式资源池，而另外一些计算机用户则认为云是一个在所用的各个服务器上实行分布式计算的服务器集群。 传统上，一个分布式计算系统往往由一个自主管理域（如一个研究实验室或公司）为内部计算需要而拥有和使用。然而，这些传统系统遭遇数个性能瓶颈：系统维护需要不断进行；利用率差；与硬件／软件升级有关的费用日益增长。作为一种按需计算范式，云计算可解决这些问题或可使我们摆脱这些问题。 Unit 10翻译Intruder (入侵者) attacks range from the benign(良性的，温和的) to the serious. 入侵者攻击从温和的到严重的形形色色。 At the benign end of the scale, there are many people who simply wish to explore internets and see what is out there. 在这一系列攻击的温和端，有许多人只是希望探查互联网，看看那里有什么。 At the serious end are individuals who are attempting to read privileged data, perform unauthorized modifications to data, or disrupt the system. 在严重端的是试图阅读特许数据、对数据进行未经授权的修改或扰乱系统的个人。 The objective of the intruder is to gain access to a system or to increase the range of privileges accessible on a system. 入侵者的目标是获得进入一个系统的机会，或者增加在一个系统中可以使用的特权范围。 Most initial attacks use system or software vulnerabilities that allow a user to execute code that opens a back door into the system. 初始攻击大多利用系统或软件的脆弱之处，这些脆弱之处允许用户执行相应的代码，打开进入系统的后门。 Intruders can get access to a system by exploiting attacks such as buffer overflows(缓存溢出) on a program that runs with certain privileges. 入侵者可对具有某些运行特权的程序实施像缓存溢出这样的攻击，利用此类攻击获得进入一个系统的机会。 Alternatively, the intruder attempts to acquire information that should have been protected. 另外，入侵者也试图获取应予保护的信息。 In some cases, this information is in the form of a user password. 在有些情况下，这种信息是以用户口令的形式存在的。 With knowledge of some other user’s password, an intruder can log in to a system and exercise all the privileges accorded to the legitimate user. 知道了某个其他用户的口令之后，入侵者就可以登录系统并行使赋予合法用户的所有特权。 入侵者攻击从温和的到严重的形形色色。在这一系列攻击的温和端，有许多人只是希望探查互联网，看看那里有什么。在严重端的是试图阅读特许数据、对数据进行未经授权的修改或扰乱系统的个人。 入侵者的目标是获得进入一个系统的机会，或者增加在一个系统中可以使用的特权范围。初始攻击大多利用系统或软件的脆弱之处，这些脆弱之处允许用户执行相应的代码，打开进入系统的后门。入侵者可对具有某些运行特权的程序实施像缓存溢出这样的攻击，利用此类攻击获得进入一个系统的机会。 另外，入侵者也试图获取应予保护的信息。在有些情况下，这种信息是以用户口令的形式存在的。知道了某个其他用户的口令之后，入侵者就可以登录系统并行使赋予合法用户的所有特权.","categories":[{"name":"英语","slug":"英语","permalink":"https://www.codeforce.top/categories/%E8%8B%B1%E8%AF%AD/"}],"tags":[{"name":"英语","slug":"英语","permalink":"https://www.codeforce.top/tags/%E8%8B%B1%E8%AF%AD/"}]},{"title":"计算机英语-完形填空","slug":"计算机英语-完形填空","date":"2021-01-11T02:17:32.000Z","updated":"2021-01-11T02:20:57.425Z","comments":true,"path":"2021/01/11/ji-suan-ji-ying-yu-wan-xing-tian-kong/","link":"","permalink":"https://www.codeforce.top/2021/01/11/ji-suan-ji-ying-yu-wan-xing-tian-kong/","excerpt":"","text":"Unit 1完型填空​ We can define a computer as a device that accepts input, processes data, stores data, and produces output. According to the mode of processing, computers are either analog or digital. They can also be classified as mainframes, minicomputers, workstations, or microcomputers. All else (for example, the age of the machine) being equal, this categorization provides some indication of the computer’s speed, size, cost, and abilities. ​ Ever since the advent of computers, there have been constant changes. First-generation computers of historic significance, such as UNIVAC (通用自动计算机), introduced in the early 1950s, were based on vacuum tubes. Second-generation computers, appearing in the early 1960s, were those in which transistors replaced vacuum tubes. In third-generation computers, dating from the 1960s, integrated circuits replaced transistors. In fourth-generation computers such as microcomputers, which first appeared in the mid-1970s, large-scale integration enabled thousands of circuits to be incorporated on one chip. Fifth-generation computers are expected to combine very-large-scale integration with sophisticated approaches to computing, including artificial intelligence and true distributed processing. ​ 我们可以将计算机定义为接受输入、处理数据、存储数据和产生输出的设备。根据处理方式，计算机可以是模拟的，也可以是数字的。它们也可以分为大型机、小型计算机、工作站或微型计算机。除此之外（例如，机器的年龄）相同，这种分类提供了计算机速度、大小、成本和能力的一些指示.自从计算机出现以来，一直在不断地变化。具有历史意义的第一代计算机，如20世纪50年代初推出的UNIVAC，都是以真空管为基础的。20世纪60年代初出现的第二代计算机是晶体管取代真空管的计算机。在20世纪60年代的第三代计算机中，集成电路取代了晶体管。在20世纪70年代中期首次出现的第四代计算机（如微型计算机）中，大规模集成使得成千上万的电路集成在一个芯片上。预计第五代计算机将结合非常大规模的集成和复杂的计算方法，包括人工智能和真正的分布式处理。 Unit 2完型填空CD-ROM stands for compact disc read-only memory. Unlike floppy and hard disks, which use magnetic charges to represent 1s and 0s, optical discs use reflected light. On a CD-ROM disc, 1s and 0s are represented by flat areas and bumpy(高低不平的) areas (called “pits”) on its bottom surface. The CD-ROM disc is read by a laser that projects a tiny beam of light on these areas. The amount of reflected light determines whether the area represents a 1 or a 0. Like a commercial CD found in music stores, a CD-ROM is a “read-only” disc. Read-only means it cannot be written on or erased by the user. Thus, you as a user have access only to the data imprinted (压印) by the publisher. A single CD-ROM disc can store 650 megabytes (兆字节) of data. That is equivalent to 451 floppy disks. With that much information on a single disc, the time to retrieve or access the information is very important. An important characteristic of CD-ROM drives is their access rate. Unit 3完形填空A programming language is a language used to write instructions for the computer. It lets the programmer express data processing in a symbolic manner without regard to machine-specific details. The difficulty of writing programs in the machine language of 0s and 1s led first to the development of assembly language, which allows programmers to use mnemonics (助记符) for instructions and symbols for variables. Such programs are then translated by a program known as an assembler (汇编程序，汇编器) into the binary encoding used by the computer. Other pieces of system software known as linking loaders(连接装入程序) combine pieces of assembled code and load them into the machine’s main memory unit, where they are then ready for execution. The concept of linking separate pieces of code was important, since it allowed “libraries” of programs to be built up to carry out common tasks—a first step toward the increasingly emphasized notion of software reuse. Assembly language was found to be sufficiently inconvenient that higher-level languages (closer to natural languages) were invented in the 1950s for easier, faster programming; along with them came the need for compilers, programs that translate high-level language programs into machine code. As programming languages became more powerful and abstract, building efficient compilers that create high-quality code in terms of execution speed and storage consumption became an interesting computer science problem in itself. 编程语言是一种用来为计算机编写指令的语言。它允许程序员以符号方式表示数据处理，而不考虑机器的特定细节。用0和1的机器语言编写程序的困难首先导致了汇编语言的发展，它允许程序员使用助记符（mnemonics）作为指令和变量符号。然后，这种程序被称为汇编程序（汇编器）的程序翻译成计算机使用的二进制编码。其他系统软件被称为链接加载程序（linking loaders，linking loaders）将组装好的代码组合在一起，加载到机器的主内存单元中，然后在那里它们就可以执行了。连接不同代码片段的概念很重要，因为它允许程序的“库”被构建来执行共同的任务，这是朝着日益强调的软件重用概念迈出的第一步。汇编语言被认为是非常不方便的，更高级的语言（更接近自然语言）在20世纪50年代被发明出来，以便更容易、更快地进行编程；随之而来的是对编译器的需求，即将高级语言程序翻译成机器码的程序。随着编程语言变得越来越强大和抽象，构建高效的编译器来创建执行速度和存储消耗方面的高质量代码本身就成为一个有趣的计算机科学问题。 Unit 6完型填空A database is any collection of data organized for storage in a computer memory and designed for easy access by authorized users. The data may be in the form of text, numbers, or encoded graphics. Small databases were first developed or funded by the U.S. government for agency or professional use. In the 1960s, some databases became commercially available, but their use was funnelled (传送) through a few so-called research centers that collected information inquiries and handled them in batches (批，批量). Online databases—that is, databases available to anyone who could link up to them by computer—first appeared in the 1970s. Since their first, experimental appearance in the 1950s, databases have become so important that they can be found in almost every field of information. Government, military, and industrial databases are often highly restricted, and professional databases are usually of limited interest. A wide range of commercial, governmental, and nonprofit databases are available to the general public, however, and may be used by anyone who owns or has access to the equipment that they require. Unit 9完型填空The architecture of a cloud is developed at three layers: infrastructure, platform, and application. The infrastructure layer is deployed first to support IaaS (Infrastructure as a Service) services. This layer serves as the foundation for building the platform layer of the cloud for supporting PaaS (Platform as a Service) services. In turn, the platform layer is a foundation for implementing the application layer for SaaS applications. The infrastructure layer is built with virtualized compute, storage, and network resources. The abstraction of these hardware resources is meant to provide the flexibility demanded by users. Internally, virtualization realizes automated provisioning of resources and optimizes the infrastructure management process. The platform layer is for general-purpose and repeated usage of the collection of software resources. This layer provides users with an environment to develop their applications, to test operation flows, and to monitor execution results and performance. In a way, the virtualized cloud platform serves as a “system middleware (中间件)” between the infrastructure and application layers of the cloud. The application layer is formed with a collection of all needed software modules for SaaS applications. Service applications in this layer include daily office management work. The application layer is also heavily used by enterprises in business marketing and sales, consumer relationship management, financial transactions, and supply chain management. Unit 10完型填空An access control mechanism mediates between a user (or a process executing on behalf of a user) and system resources, such as applications, operating systems, firewalls, routers, files, and databases. The system must first authenticate (验证) a user seeking access. Typically the authentication function determines whether the user is permitted to access the system at all. Then the access control function determines if the specific requested access by this user is permitted. A security administrator maintains an authorization (授权) database that specifies what type of access to which resources is allowed for this user. The access control function consults this database to determine whether to grant access. An auditing function monitors and keeps a record of user accesses to system resources. In practice, a number of components may cooperatively share the access control function. All operating systems have at least a rudimentary (基本的), and in many cases a quite robust, access control component. Add-on security packages can add to the native access control capabilities of the OS. Particular applications or utilities, such as a database management system, also incorporate access control functions. External devices, such as firewalls, can also provide access control services. 访问控制机制在用户（或代表用户执行的进程）和系统资源（如应用程序、操作系统、防火墙、路由器、文件和数据库）之间进行中介。系统必须首先对寻求访问的用户进行身份验证。通常，身份验证功能确定是否允许用户访问系统。然后访问控制功能确定是否允许此用户请求的特定访问。安全管理员维护一个授权（authorization）数据库，该数据库指定允许此用户访问哪些资源的访问类型。访问控制函数将查询此数据库以确定是否授予访问权限。审计功能监视并记录用户对系统资源的访问。 在实践中，多个组件可以协作地共享访问控制功能。所有的操作系统都至少有一个基本的，并且在许多情况下都有一个相当健壮的访问控制组件。附加安全包可以添加到操作系统的本机访问控制功能中。特定的应用程序或实用程序（如数据库管理系统）也包含访问控制功能。外部设备（如防火墙）也可以提供访问控制服务。","categories":[{"name":"英语","slug":"英语","permalink":"https://www.codeforce.top/categories/%E8%8B%B1%E8%AF%AD/"}],"tags":[{"name":"英语","slug":"英语","permalink":"https://www.codeforce.top/tags/%E8%8B%B1%E8%AF%AD/"}]},{"title":"计算机英语-短语翻译","slug":"计算机英语-短语翻译","date":"2021-01-11T02:15:00.000Z","updated":"2021-01-11T02:17:11.325Z","comments":true,"path":"2021/01/11/ji-suan-ji-ying-yu-duan-yu-fan-yi/","link":"","permalink":"https://www.codeforce.top/2021/01/11/ji-suan-ji-ying-yu-duan-yu-fan-yi/","excerpt":"","text":"Unit 1短语翻译 artificial intelligence 人工智能 paper-tape reader 纸带阅读器 optical computer 光计算机 neural network 神经网络 instruction set 指令集 parallel processing 并行处理 difference engine 差分机 versatile logical element 通用逻辑元件 silicon substrate 硅衬底 vacuum tube 真空管 数据的存储与处理 the storage and handling of data 超大规模集成电路 very large-scale integrated circuit 中央处理器 central processing unit 个人计算机 personal computer 模拟计算机 analogue computer 数字计算机 digital computer 通用计算机 general-purpose computer 处理器芯片 processor chip 操作指令 operating instructions 输入设备 input device Unit 2短语翻译 function key 功能键，操作键，函数键 voice recognition module 语音识别模块 touch-sensitive region 触敏区 address bus 地址总线 flatbed scanner 平板扫描仪 dot-matrix printer 点阵打印机 parallel connection 并行连接 cathode ray tube 阴极射线管 video game 电子游戏 audio signal 音频信号 operating system 操作系统 LCD (liquid crystal display) 液晶显示(器) inkjet printer 喷墨打印机 data bus 数据总线 serial connection 串行连接 volatile memory 易失性存储器 laser printer 激光打印机 disk drive 磁盘驱动器 BIOS (Basic Input/Output System) 基本输入/输出系统 video display 视频显示器 Unit 3短语翻译 storage register 存储寄存器 function statement 函数语句 program statement 程序语句 object-oriented language 面向对象语言 assembly language 汇编语言 intermediate language 中间语言，中级语言 relational language 关系（型）语言 artificial language 人工语言 data declaration 数据声明 Structured Query Language 结构化查询语言 可执行程序 executable program 程序模块 program module 条件语句 conditional statement 赋值语句 assignment statement 逻辑语言 logic language 机器语言 machine language 函数式语言 functional language 程序设计语言 programming language 运行计算机程序 run a computer program 计算机程序员 computer programmer Unit 6短语翻译 end user 最终用户，终端用户 atomic operation 原子操作 database administrator 数据库管理员 relational database model 关系数据库模型 local data 本地数据 object-oriented database 面向对象数据库 database management system (DBMS) 数据库管理系统 entity-relationship model (ERM) 实体关系模型 distributed database 分布式数据库 flat file 平面文件 二维表 two-dimensional table 数据属性 data attribute 数据库对象 database object 存储设备 storage device 数据类型 data type 数据插入与删除 data insertion and deletion 层次数据库模型 hierarchical database model 数据库体系结构 database architecture 关系数据库管理系统 relational database management system (RDBMS) 全局控制总线 global control bus Unit 9短语翻译 server farm 大型机服务器 access protocol 存取协议，访问协议 storage area network 存储区域网（络） high-throughput computing 高吞吐（量）计算 server cluster 服务器集群 public cloud 公共云 grid computing 网格计算 security-aware cloud architecture 具有安全意识的云体系结构 social networking 社交网络 utility computing 效用计算 云计算提供商 cloud computing provider 存储芯片 memory chip 基于内部网的私有云 intranet-based private cloud 网络带宽 network bandwidth 混合云 hybrid cloud 磁盘阵列 disk array 软件即服务 Software as a Service (SaaS) 集群计算 cluster computing 虚拟化计算机资源 virtualized computer resources 多核处理器 multi-core processor Unit 10短语翻译 backup system 备份系统 encryption key （加密）密钥 data confidentiality 数据机密性 system vulnerability 系统脆弱性，系统脆弱之处 unauthorized access 未经授权的访问，越权存取 intrusion detection system 入侵检测系统 after-action recovery 事后恢复 software piracy 软件侵权 authorized user 特许用户 data unit 数据单元，数据单位 软件版本 software version 数据完整性 data integrity 系统崩溃 system crash 病毒检查软件 virus-checking software 综合安全策略 comprehensive security strategy 软件配置管理 software configuration management 故障隔离 fault isolation 统计数据库 statistical database 保密的加密算法 secure encryption algorithm 数据流 data stream","categories":[{"name":"英语","slug":"英语","permalink":"https://www.codeforce.top/categories/%E8%8B%B1%E8%AF%AD/"}],"tags":[{"name":"英语","slug":"英语","permalink":"https://www.codeforce.top/tags/%E8%8B%B1%E8%AF%AD/"}]},{"title":"注解与反射","slug":"反射与注解","date":"2019-09-07T01:25:00.000Z","updated":"2020-06-30T16:41:39.162Z","comments":true,"path":"2019/09/07/fan-she-yu-zhu-jie/","link":"","permalink":"https://www.codeforce.top/2019/09/07/fan-she-yu-zhu-jie/","excerpt":"","text":"注解与反射 这一章节对理解框架十分重要，包括接下来的Spring、Mybatis 文章参考以下内容，转载或引用请注明原作者和引用文章 https://www.bilibili.com/video/BV1p4411P7V3 注解（Annotation）简介 注解是JDK 5.0开始引入技术（Annotation） 注解的作用 对程序作介绍（注释是对人来用的） 被其他程序使用 内置注解 @Override 在Java.lang.Override，声明重写超类后的第二个方法，作用范围：方法 @Deprecated 作用范围：方法，属性，类 表示不推荐使用此元素 @SuppressWarnings 用来抑制编译警告 与前俩个不同的是，此注解需要添加一个参数 @SuppressWarnings(“all”) @SuppressWarnings(“unchecked”) @SuppressWarnings(value ={“unchecked”,”deprecation”}) ….. 元注解 作用：负责注解其他注解，Java定义了四个标准类型 这些类型和它们所支持的类在Java.lang.Override包中可以找到 .( @Target , @Retention ,@Documented , @Inherited ) @Target：描述注解使用范围,所有范围如下 @Retention : 表示需要在什么级别保存该注释信息 , 用于描述注解的生命周期 (SOURCE &lt; CLASS &lt; RUNTIME) @Document：说明该注解将被包含在Javadoc中 @Inherited：说明子类可以继承父类中的该注解J 自定义注解 使用 @interface自定义注解时 , 自动继承了java.lang.annotation.Annotation接口 分析 @ interface用来声明一个注解 , 格式 : public @ interface 注解名 { 定义内容 } 若public不写默认为default 其中的每一个方法实际上是声明了一个配置参数. 方法的名称就是参数的名称. 返回值类型就是参数的类型 ( 返回值只能是基本类型,Class , String , enum ). 如果只有一个参数成员 , 一般参数名为value，通常这个参数名不需要在使用注解时表明 注解元素必须要有值 , 我们定义注解元素时 , 经常使用空字符串,0作为默认值 . 当默认值为-1时表示不存在 import java.lang.annotation.ElementType; import java.lang.annotation.Retention; import java.lang.annotation.RetentionPolicy; import java.lang.annotation.Target; public class Test3 { @MyAnnotation1(name = \"CodeForce\") public void test(){ } } @Target({ElementType.TYPE,ElementType.METHOD}) @Retention(RetentionPolicy.RUNTIME) @interface MyAnnotation1{ String name() default \"\"; int id() default -1 ;//-1代表不存在 等同于字符串的indexof()返回-1 String value() default \"\"; } 反射读取注解利用反射读取注解信息三步骤： 定义注解 在类中使用注解 使用反射获取注解，一般此步骤都由框架集成，以下手动实现 import java.lang.annotation.*; import java.lang.reflect.Field; public class test5 { public static void main(String[] args) throws ClassNotFoundException, NoSuchFieldException { //通过反射获取类全部信息，所有东西 Class c1 = Class.forName(\"Person\"); //得到这个类的注解 Annotation[] annotations = c1.getAnnotations(); for (Annotation annotation : annotations) { System.out.println(annotation); } //获得类的注解value值 OnTable annotation = (OnTable) c1.getAnnotation(OnTable.class); System.out.println(annotation.value()); //获得类指定注解的值 Field name = c1.getDeclaredField(\"name\"); OnFiled onFiled = name.getAnnotation(OnFiled.class); System.out.println(onFiled.columnName()+\"---\"+onFiled.type()+\"---\"+onFiled.length()); //此方法就是通过得到信息,在JDBC生成相关SQL语句 } } @OnTable(\"db_person\") class Person{ @OnFiled(columnName = \"db_name\",type = \"varchar\",length = 3) private String name; public String getName() { return name; } public void setName(String name) { this.name = name; } @Override public String toString() { return \"Person{\" + \"name='\" + name + '\\'' + '}'; } } @Target(value = {ElementType.FIELD}) @Retention(value = RetentionPolicy.RUNTIME) @interface OnFiled{ String columnName(); //列名 String type(); //类型 int length();//长度 } @Target(value = {ElementType.TYPE}) @Retention(value = RetentionPolicy.RUNTIME) @interface OnTable{ String value();//只有一个推荐使用value } 反射（Reflection）动态语言与静态语言： Java虽然作为静态语言，但是利用反射机制使得Java拥有部分动态语言的特性 反射Reflection（反射）是Java被视为动态语言的关键，反射机制允许程序在执行期借助于Reflection API 取得任何类的内部信息，并能直接操作任意对象的内部属性及方法。 Class c = Class.forName(\"java.util.List\"); 加载完类之后，在堆内存的方法区中就产生了一个Class类型的对象（一个类只有一个Class对象），这个对象就包含了完整的类的结构信息。我们可以通过这个对象看到类的结构。这个对象就像一面镜子，透过这个镜子看到类的结构，所以，我们形象的称之为：反射 {% asset_img image-20200630220318565.png %} Java反射提供的功能 在运行时判断任意一个对象所属的类 在运行时构造任意一个类的对象 在运行时判断任意一个类所具有的成员变量和方法 在运行时获取泛型信息 在运行时调用任意一个对象的成员变量和方法 在运行时处理注解(框架注解开发的原理) 生成动态代理 ……. Java反射优点和缺点优点：可以实现动态创建对象和编译，体现出很大的灵活性 ! 缺点：对性能有影响。使用反射基本上是一种解释操作，我们可以告诉JVM，我们希望做什么并且它满足我们的要求。这类操作总是慢于直接执行相同的操作。 反射相关的主要API java.lang.Class : 代表一个类 java.lang.reflect.Method : 代表类的方法 java.lang.reflect.Field : 代表类的成员变量 java.lang.reflect.Constructor : 代表类的构造器 …… Class类如果还得的话，Object作为所有类的基类有个getClass()方法 public final native Class&lt;?> getClass(); 以上的方法返回值的类型是一个Class类，此类是Java反射的源头，实际上所谓反射从程序的运行结果来看也很好理解，即：可以通过对象反射求出类的名称。 对象照镜子后可以得到的信息：某个类的属性、方法和构造器、某个类到底实现了哪些接口。对于每个类而言，JRE 都为其保留一个不变的 Class 类型的对象。一个 Class 对象包含了特定某个结构(class/interface/enum/annotation/primitive type/void/[])的有关信息。 Class 本身也是一个类 Class 对象只能由系统建立对象 一个加载的类在 JVM 中只会有一个Class实例 一个Class对象对应的是一个加载到JVM中的一个.class文件 每个类的实例都会记得自己是由哪个 Class 实例所生成 通过Class可以完整地得到一个类中的所有被加载的结构 Class类是Reflection的根源，针对任何你想动态加载、运行的类，唯有先获得相应的Class对象 获取class几种方式 还有一种利用类加载器在下文中会提到 方法名 功能说明 static ClassforName(String name) 返回指定类名name的Class对象 Object newInstance() 调用缺省构造函数，返回Class对象的一个实例 getName() 返回此Class对象所表示的实体（类，接口，数组类或void）的名称。 Class getSuperClass() 返回当前Class对象的父类的Class对象 Class[] getinterfaces() 获取当前Class对象的接口 ClassLoader getClassLoader() 返回该类的类加载器 Constructor[] getConstructors() 返回一个包含某些Constructor对象的数组Method getMothed( Method getMothed(Stringname,Class.. T) 返回一个Method对象，此对象的形参类型为paramType Field[] getDeclaredFields() 返回Field对象的一个数组 哪些类型可以有class对象 class：外部类，成员(成员内部类，静态内部类)，局部内部类，匿名内部类。 interface：接口 []：数组 enum：枚举 annotation：注解@interface primitive type：基本数据类型 void 这里要注意一点的是数组只要元素类型与维度一样，就是同一个class Java内存分析 类的加载过程 类的加载与ClassLoader的理解 加载 将class文件字节码内容加载到内存中，并将这些静态数据转换成方法区的运行时数据结构，然后生成一个代表这个类的java.lang.Class对象. 链接：将Java类的二进制代码合并到JVM的运行状态之中的过程。 验证：确保加载的类信息符合JVM规范，没有安全方面的问题 准备：正式为类变量（static）分配内存并设置类变量默认初始值的阶段，这些内存都将在方法区中进行分配。 解析：虚拟机常量池内的符号引用（常量名）替换为直接引用（地址）的过程。 初始化： 执行类构造器()方法的过程。类构造器()方法是由编译期自动收集类中所有类变量的赋值动作和静态代码块中的语句合并产生的。（类构造器是构造类信息的，不是构造该类对象的构造器）。 当初始化一个类的时候，如果发现其父类还没有进行初始化，则需要先触发其父类的初始化。 虚拟机会保证一个类的()方法在多线程环境中被正确加锁和同步。 什么时候会发生类初始化？ 类的主动引用（一定会发生类的初始化） main在虚拟机启动时的初始化 new 一个类的对象 调用类的静态成员（除了final常量）和静态方法 对类进行反射调用 当初始化一个类，如果父类没有被初始化，则会先初始化它的父类 类的被动引用（不会发生类的初始化） 当访问一个静态域时，只有真正声明这个域的类才会被初始化。如：当通过子类引用父类的静态变量，不会导致子类初始化 通过数组定义类引用，不会触发此类的初始化 类名[] 名称 = new 类名[数量];//不会初始化此类 引用常量不会触发此类的初始化（常量在链接阶段就存入调用类的常量池中了） 类加载器的作用 类加载的作用：将class文件字节码内容加载到内存中，并将这些静态数据转换成方法区的运行时数据结构，然后在堆中生成一个代表这个类的java.lang.Class对象，作为方法区中类数据的访问入口。 类缓存：标准的JavaSE类加载器可以按要求查找类，但一旦某个类被加载到类加载器中，它将维持加载（缓存）一段时间。不过JVM垃圾回收机制可以回收这些Class对象 {% asset_img image-20200630231710334.png %} 类加载器作用是用来把类(class)装载进内存的。JVM 规范定义了如下类型的类的加载器 {% asset_img image-20200630231743009.png %} 创建运行时类的对象通过反射获取运行时类的完整结构Field、Method、Constructor、Superclass、Interface、Annotation 实现的全部接口 所继承的父类 全部的构造器 全部的方法 全部的Field 注解 …… 有了Class对象，能做什么事情 创建类的对象：调用Class对象的newInstance()方法 类必须有一个无参数的构造器。 类的构造器的访问权限需要足够 若没有无参构造器，则按照以下方式创建 通过Class类的getDeclaredConstructor(Class … parameterTypes)取得本类的指定形参类型的构造器 向构造器的形参中传递一个对象数组进去，里面包含了构造器中所需的各个参数。 通过Constructor实例化对象 //c1是类getclass得来的 //无参构造 Person person = (Person)c1.newInstance(); //有参构造 Constructor constructor = c1.getDeclaredConstructor(String.class); Person person1 = (Person) constructor.newInstance(\"CodeForce\"); System.out.println(person1); 调用指定方法 通过反射，调用类中的方法，通过Method类完成。 通过Class类的getMethod(String name,Class…parameterTypes)方法取得一个Method对象，并设置此方法操作时所需要的参数类型。 之后使用Object invoke(Object obj, Object[] args)进行调用，并向方法中传递要设置的obj对象的参数信息。 //通过反射获取一个方法(反射操作方法) Method setName = c1.getDeclaredMethod(\"setName\", String.class); setName.invoke(person,\"Code\"); System.out.println(person.getName()); Object 对应原方法的返回值，若原方法无返回值，此时返回null 若原方法若为静态方法，此时形参Object obj可为null 若原方法形参列表为空，则Object[] args为null 若原方法声明为private,则需要在调用此invoke()方法前，显式调用方法对象的setAccessible(true)方法，将可访问private的方法。 Field name = c1.getDeclaredField(\"name\"); //name作为private属性，正常不能直接访问，可通过setAccessible关闭检测 name.setAccessible(true); name.set(person,\"code1\"); System.out.println(person.getName()); setAccessible Method和Field、Constructor对象都有setAccessible()方法。 setAccessible作用是启动和禁用访问安全检查的开关。 参数值为true则指示反射的对象在使用时应该取消Java语言访问检查。 提高反射的效率。如果代码中必须用反射，而该句代码需要频繁的被调用，那么请设置为true。 使得原本无法访问的私有成员也可以访问 参数值为false则指示反射的对象应该实施Java语言访问检查 反射操作泛型 Java采用泛型擦除的机制来引入泛型 , Java中的泛型仅仅是给编译器javac使用的,确保数据的安全性和免去强制类型转换问题 , 但是 , 一旦编译完成 , 所有和泛型有关的类型全部擦除 为了通过反射操作这些类型 , Java新增了 ParameterizedType , GenericArrayType , TypeVariable和 WildcardType 几种类型来代表不能被归一到Class类中的类型但是又和原始类型齐名的类型. ParameterizedType : 表示一种参数化类型,比如Collection GenericArrayType : 表示一种元素类型是参数化类型或者类型变量的数组类型 TypeVariable : 是各种类型变量的公共父接口 WildcardType : 代表一种通配符类型表达式 反射操作注解详情请看反射读取注解那段","categories":[{"name":"Java SE","slug":"Java-SE","permalink":"https://www.codeforce.top/categories/Java-SE/"}],"tags":[{"name":"Java SE","slug":"Java-SE","permalink":"https://www.codeforce.top/tags/Java-SE/"},{"name":"框架","slug":"框架","permalink":"https://www.codeforce.top/tags/%E6%A1%86%E6%9E%B6/"}]}],"categories":[{"name":"英语","slug":"英语","permalink":"https://www.codeforce.top/categories/%E8%8B%B1%E8%AF%AD/"},{"name":"Java SE","slug":"Java-SE","permalink":"https://www.codeforce.top/categories/Java-SE/"}],"tags":[{"name":"英语","slug":"英语","permalink":"https://www.codeforce.top/tags/%E8%8B%B1%E8%AF%AD/"},{"name":"Java SE","slug":"Java-SE","permalink":"https://www.codeforce.top/tags/Java-SE/"},{"name":"框架","slug":"框架","permalink":"https://www.codeforce.top/tags/%E6%A1%86%E6%9E%B6/"}]}